app/views/teams/_form.html.haml

SELECT "competitions".* FROM "competitions"
---
    .input
      = select_tag "competition_id", options_from_collection_for_select(Competition.all.find_all{ |c| c.deadline_not_expired? }, "id", "name")
  .clearfix.actions