app/views/teams/show.html.haml

    %b #{t("activerecord.attributes.team.leader")}:
    = user_name(User.find(@team.leader_id))
---
SELECT "users".* FROM "users" WHERE "users"."id" = 11 LIMIT 1