app/views/teams/show.html.haml

  %ul
  - @team.user_team_memberships.each do |user_team_membership|
---
SELECT "user_team_memberships".* FROM "user_team_memberships" WHERE "user_team_memberships"."team_id" = 1