app/controllers/admin/competitions_controller.rb

SELECT "competitions".* FROM "competitions" WHERE (start <= '2012-05-21 22:08:59.031438' AND deadline >= '2012-05-21 22:08:59.031438')
---
  def index
    current_time = Time.now
    @current_competitions = Competition.where("start <= ? AND deadline >= ?", current_time, current_time)

SELECT "competitions".* FROM "competitions" WHERE "competitions"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @competition = Competition.find(params[:id])

SELECT "competitions".* FROM "competitions" WHERE "competitions"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "competitions" SET "start" = '2012-05-21 21:30:00.000000', "deadline" = '2012-05-21 22:00:00.000000', "freeze_time" = '2012-05-21 20:50:00.000000', "updated_at" = '2012-05-21 21:44:30.322010' WHERE "competitions"."id" = 1
---
  def update
    @competition = Competition.find(params[:id])
    if @competition.update_attributes(params[:competition])

INSERT INTO "competitions" ("created_at", "deadline", "description", "freeze_time", "is_active", "max_users", "name", "needs_confirmation", "organizer_id", "start", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @competition = Competition.new(params[:competition])
    #need to find if user if organizator is correct! don't trust data You receive
    if @competition.save

SELECT "competitions".* FROM "competitions" WHERE "competitions"."id" = ? LIMIT 1  [["id", "1"]]
---
  def ranking
    @competition = Competition.find(params[:competition_id])