app/controllers/competitions_controller.rb

SELECT "competitions".* FROM "competitions" WHERE (is_active = 't' AND start <= '2012-05-21 21:39:26.404234' AND deadline >= '2012-05-21 21:39:26.404234')
---
  def index
    @competitions = Competition.all

SELECT "competitions".* FROM "competitions" WHERE "competitions"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @competition        = Competition.find(params[:id])