app/controllers/teams_controller.rb

INSERT INTO "teams" ("admin_id", "competition_id", "created_at", "leader_id", "name", "organization", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
INSERT INTO "user_team_memberships" ("created_at", "team_id", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["created_at", Tue, 22 May 2012 00:43:44 CEST +02:00], ["team_id", 1], ["updated_at", Tue, 22 May 2012 00:43:44 CEST +02:00], ["user_id", 11]]
---
  def create
    params[:team] = {
        :name      => params[:name],
        :leader_id => current_user.id
    }
    @team = Team.new(params[:team])

    respond_to do |format|
      if @team.save
        @team_membership = TeamMembership.new({
            :team_id => @team.id,
            :competition_id => params[:competition_id]
        })
        if @team_membership.save

SELECT "teams".* FROM "teams" WHERE "teams"."id" = ? LIMIT 1  [["id", "4"]]
UPDATE "teams" SET "competition_id" = 1, "updated_at" = '2012-05-21 22:45:25.449751' WHERE "teams"."id" = 3
---
  def update
    @team = Team.find(params[:id])

    respond_to do |format|
      if @team.update_attributes(params[:team])