app/views/admin/competitions/_form.html.haml

  .emptyfix
    = f.label :organizer_id
    .input= select "competition", "organizer_id",  User.all.collect {|p| [ p.email, p.id ] }, :class => "xlarge"
  .emptyfix
---
SELECT "users".* FROM "users"